GPT2LMHeadModel(
  (transformer): GPT2Model(
    (wte): Embedding(50257, 1600), 80,411,200 params
    (wpe): Embedding(1024, 1600), 1,638,400 params
    (drop): Dropout(p=0.1, inplace=False), 0 params
    (h): ModuleList(
      (0): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (1): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (2): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (3): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (4): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (5): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (6): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (7): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (8): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (9): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (10): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (11): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (12): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (13): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (14): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (15): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (16): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (17): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (18): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (19): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (20): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (21): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (22): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (23): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (24): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (25): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (26): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (27): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (28): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (29): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (30): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (31): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (32): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (33): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (34): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (35): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (36): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (37): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (38): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (39): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (40): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (41): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (42): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (43): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (44): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (45): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (46): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
      (47): GPT2Block(
        (ln_1): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (attn): GPT2SdpaAttention(
          (c_attn): Conv1D(), 7,684,800 params
          (c_proj): Conv1D(), 2,561,600 params
          (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
          (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 10,246,400 params
        (ln_2): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
        (mlp): GPT2MLP(
          (c_fc): Conv1D(), 10,246,400 params
          (c_proj): Conv1D(), 10,241,600 params
          (act): NewGELUActivation(), 0 params
          (dropout): Dropout(p=0.1, inplace=False), 0 params
        ), 20,488,000 params
      ), 30,740,800 params
    ), 1,475,558,400 params
    (ln_f): LayerNorm((1600,), eps=1e-05, elementwise_affine=True), 3,200 params
  ), 1,557,611,200 params
  (lm_head): Linear(in_features=1600, out_features=50257, bias=False), 80,411,200 params
), 1,638,022,400 params
=======================================================================
Total params: 1,688,354,048
Trainable params: 1,638,022,400
Non-trainable params: 50,331,648
-----------------------------------------------------------------------