DataParallel(
  (module): GPT2LMHeadModel(
    (transformer): GPT2Model(
      (wte): Embedding(50257, 1280), 64,328,960 params
      (wpe): Embedding(1024, 1280), 1,310,720 params
      (drop): Dropout(p=0.1, inplace=False), 0 params
      (h): ModuleList(
        (0): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (1): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (2): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (3): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (4): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (5): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (6): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (7): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (8): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (9): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (10): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (11): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (12): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (13): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (14): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (15): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (16): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (17): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (18): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (19): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (20): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (21): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (22): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (23): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (24): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (25): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (26): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (27): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (28): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (29): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (30): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (31): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (32): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (33): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (34): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
        (35): GPT2Block(
          (ln_1): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (attn): GPT2SdpaAttention(
            (c_attn): Conv1D(), 4,919,040 params
            (c_proj): Conv1D(), 1,639,680 params
            (attn_dropout): Dropout(p=0.1, inplace=False), 0 params
            (resid_dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 6,558,720 params
          (ln_2): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
          (mlp): GPT2MLP(
            (c_fc): Conv1D(), 6,558,720 params
            (c_proj): Conv1D(), 6,554,880 params
            (act): NewGELUActivation(), 0 params
            (dropout): Dropout(p=0.1, inplace=False), 0 params
          ), 13,113,600 params
        ), 19,677,440 params
      ), 708,387,840 params
      (ln_f): LayerNorm((1280,), eps=1e-05, elementwise_affine=True), 2,560 params
    ), 774,030,080 params
    (lm_head): Linear(in_features=1280, out_features=50257, bias=False), 64,328,960 params
  ), 838,359,040 params
), 838,359,040 params
=======================================================================
Total params: 3,504,431,104
Trainable params: 3,353,436,160
Non-trainable params: 150,994,944
-----------------------------------------------------------------------